- 1. READING ECOMMERCE SET USING PANDAS

In [1]:
# import pandas 
import pandas as pd

In [2]:
# Reading the dataset
df = pd.read_csv('Walmart_Sales.csv')

In [3]:
# first 5 rows
df.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106

In [4]:
df.isnull().sum()

Store           0
Date            0
Weekly_Sales    0
Holiday_Flag    0
Temperature     0
Fuel_Price      0
CPI             0
Unemployment    0
dtype: int64

In [5]:
# DATATYPES
df.dtypes

Store             int64
Date             object
Weekly_Sales    float64
Holiday_Flag      int64
Temperature     float64
Fuel_Price      float64
CPI             float64
Unemployment    float64
dtype: object

2. ESTABLISHING SQL CONNECTIONS

In [6]:
import mysql.connector as msql

- 3. DATABASE CREATED

In [7]:
try:
    # Calling db by using mysql.connect with MySQL workbench credentials
    conn = msql.connect(host='localhost', user='root',password='root&&5655')
    
    # Connection checking (like HTTP request status_code 200)
    if conn.is_connected(): 
        cursor = conn.cursor()
        
    # The cursor allows you to execute SQL statements and interact with the database.
        cursor.execute("CREATE DATABASE ECOMMERCE") # Inside SQL Command
        print("Database is created!")
        
except msql.Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1007 (HY000): Can't create database 'ECOMMERCE'; database exists

- 4. TABLE CREATION

In [8]:
try:
    # db credentials & connection
    conn = msql.connect(host='localhost', database='ECOMMERCE', user='root', password='root&&5655')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("select database();")
        
        # Retrieving Records from csv file
        record = cursor.fetchone()
        print("You're connected to database: ", record)
        
        # Table Creation
        cursor.execute('DROP TABLE IF EXISTS salesdata;')
        print('Creating table....')
        cursor.execute("CREATE TABLE salesdata(Store int,Date varchar(10),Weekly_Sales float,Holiday_Flag int,Temperature float,Fuel_Price float,CPI float,Unemployment float)") # SQL Command
        print('Table Name:'+'salesdata')
        print('Table Created !')
        
except msql.Error as e:
            print("Error while connecting to MySQL", e)

You're connected to database:  ('ecommerce',)
Creating table....
Table Name:salesdata
Table Created !

- 5. INSERTING RECORDS

In [9]:
import tqdm

In [10]:
try:
    # Traversing through each record i = index, row = data (tuple) 
    for i, row in df.iterrows():
        # string as placeholders for all diff data types  
        sql = "INSERT INTO salesdata (Store, Date, Weekly_Sales, Holiday_Flag, Temperature, Fuel_Price, CPI, Unemployment) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)"

        # Check if the number of placeholders and the number of elements in the row match
        if len(row) != sql.count("%s"):
            raise ValueError(f"Number of placeholders in SQL query ({sql.count('%s')}) does not match the number of elements in the row ({len(row)})")

        # Inserting each record as a tuple
        cursor.execute(sql, tuple(row))

        # Records count (optional)
        if i % 100 == 0:
            print(f"{i} Record inserted")

    # Commit all changes after the loop
    conn.commit()

except msql.Error as e:
    print("Error while connecting to MySQL", e)

finally:
    # Close the cursor and connection
    cursor.close()
    conn.close()

0 Record inserted
100 Record inserted
200 Record inserted
300 Record inserted
400 Record inserted
500 Record inserted
600 Record inserted
700 Record inserted
800 Record inserted
900 Record inserted
1000 Record inserted
1100 Record inserted
1200 Record inserted
1300 Record inserted
1400 Record inserted
1500 Record inserted
1600 Record inserted
1700 Record inserted
1800 Record inserted
1900 Record inserted
2000 Record inserted
2100 Record inserted
2200 Record inserted
2300 Record inserted
2400 Record inserted
2500 Record inserted
2600 Record inserted
2700 Record inserted
2800 Record inserted
2900 Record inserted
3000 Record inserted
3100 Record inserted
3200 Record inserted
3300 Record inserted
3400 Record inserted
3500 Record inserted
3600 Record inserted
3700 Record inserted
3800 Record inserted
3900 Record inserted
4000 Record inserted
4100 Record inserted
4200 Record inserted
4300 Record inserted
4400 Record inserted
4500 Record inserted
4600 Record inserted
4700 Record inserted
4800 Record inserted
4900 Record inserted
5000 Record inserted
5100 Record inserted
5200 Record inserted
5300 Record inserted
5400 Record inserted
5500 Record inserted
5600 Record inserted
5700 Record inserted
5800 Record inserted
5900 Record inserted
6000 Record inserted
6100 Record inserted
6200 Record inserted
6300 Record inserted
6400 Record inserted

- 6 . DROPING TABLE

In [11]:
try:
    # Database Credentials 
    conn = msql.connect(host='localhost', database='ECOMMERCE', user='root', password='Lokesh&&5655')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("DROP TABLE IF EXISTS salesdata;")  # SQL Command to drop the table
        print("Table Dropped")
except msql.Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

- 7.DROPING DATABASE

In [12]:
try:
    # Database Credentials 
    conn = msql.connect(host='localhost', user='root',password='Lokesh&&5655')
    if conn.is_connected():
        cursor = conn.cursor()
        cursor.execute("DROP DATABASE apeamcet2022")
        print("Database Dropped")
except msql.Error as e:
    print("Error while connecting to MySQL", e)

Error while connecting to MySQL 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)